In [12]:
# starting pandas....

import pandas as pd
# # 2d list
# li1=[13,23,3]
# li2=['John','fkdf','jenny']
# dict={'name':li2,'age':li1}
# dict

# how to create a series in pandas
# by list
s1=pd.Series([23,44,32])
s1


#by range
s1=pd.Series(range(11,21))
s1

# by dict
s1=pd.Series({"name":"sam",'age':21})
s1

# by scalar
s1=pd.Series("Hello world")
s1

# # what we can do with pandas
# # read and write data
# # manipualate the data
# # we can accesss sub sets within a large datasets
# # we can perfrom operation
# # we can do reshaping

0    Hello world
dtype: object

In [26]:
import pandas as pd

# dataframe through dict of list
df=pd.DataFrame({'name':['sam','max','tim'],'age':[23,55,33]})
df

# through dict of dict
df=pd.DataFrame({'r1':{"name":"sam","age":32,'city':'hyd'},'r2':{"name":"max","age":55}})
df

# outer keys-colums
# inner keys -index or labels


# how to access the value from the dataframe

# loc
print(df)

# loc[row index,col index]
df.loc['name',"r1"]

# # iloc
df.iloc[1,1]

       r1   r2
name  sam  max
age    32   55
city  hyd  NaN

55

In [14]:
import pandas as pd

std=pd.DataFrame({
    "Name": ["Ram", "Sita", "John", "Ali", "Maria", "Karan", "Priya", "David", "Anita", "Ravi"],
    "Age": [18, 19, 20, 21, 22, 20, 19, 23, 21, 22],
    "Math": [85, 90, 78, 88, 95, 70, 82, 76, 89, 91],
    "Science": [92, 88, 84, 76, 89, 95, 80, 85, 90, 87]
},index=range(11,21))
print(std)
std.loc[14,'Name']
std.iloc[3,0]
std.head()
std.tail()
std.head(2)

     Name  Age  Math  Science
11    Ram   18    85       92
12   Sita   19    90       88
13   John   20    78       84
14    Ali   21    88       76
15  Maria   22    95       89
16  Karan   20    70       95
17  Priya   19    82       80
18  David   23    76       85
19  Anita   21    89       90
20   Ravi   22    91       87

    Name  Age  Math  Science
11   Ram   18    85       92
12  Sita   19    90       88

In [33]:
import pandas as pd
emp={
    101: {"Name": "Alex", "Dept": "HR", "Salary": 45000},
    102: {"Name": "Sam", "Dept": "IT", "Salary": 60000},
    103: {"Name": "John", "Dept": "Finance", "Salary": 55000},
    104: {"Name": "Nina", "Dept": "IT", "Salary": 62000},
    105: {"Name": "Ravi", "Dept": "HR", "Salary": 47000},
    106: {"Name": "Sara", "Dept": "Finance", "Salary": 58000},
    107: {"Name": "David", "Dept": "Marketing", "Salary": 52000},
    108: {"Name": "Ali", "Dept": "IT", "Salary": 61000},
    109: {"Name": "Kiran", "Dept": "Finance", "Salary": 53000},
    110: {"Name": "Maria", "Dept": "HR", "Salary": 49000}
}

df=pd.DataFrame(emp).T
df

# we can add new column 
df['city']='hyd'

# we can change existing coluumn values
df['Salary']+=450

# #how to drop a column
# df.drop(['Name',"Dept"],axis=1,inplace=True)


# how to add a new row
data={"Name":"Sam","Dept":"HR","Salary":23000}

newdata=pd.DataFrame([data])
newupd=pd.concat([df,newdata],ignore_index=True)
newupd

# how to modify the existing value

newupd.iloc[1,0]='sunny'
newupd

# how to drop a perticular row
newupd.drop(1,inplace=True)
newupd

     Name       Dept Salary city
0    Alex         HR  45450  hyd
2    John    Finance  55450  hyd
3    Nina         IT  62450  hyd
4    Ravi         HR  47450  hyd
5    Sara    Finance  58450  hyd
6   David  Marketing  52450  hyd
7     Ali         IT  61450  hyd
8   Kiran    Finance  53450  hyd
9   Maria         HR  49450  hyd
10    Sam         HR  23000  NaN

In [38]:
import pandas as pd

std= pd.DataFrame({
    "StudentID": range(1, 11),
    "Name": ["Alice", "Bob", "Charlie", "None", "Eva", "Frank", "Grace", "Helen", "Ian", "Jane"],
    "Age": [20, 21, 19, 22, 20, 23, 21, 20, 22, 19],
    "Department": ["CS", "IT", "CS", "ECE", "IT", "CS", "ECE", "IT", "CS", "ECE"],
    "Math": [85, 78, 92, 65, 88, 74, 90, 82, 95, 70],
    "Science": [80, 85, 70, 60, 92, 75, 88, 78, 85, 72],
    "English": [75, 88, 82, 70, 85, 80, 90, 86, 84, 73]
})


sls = pd.DataFrame({
    "OrderID": range(101, 111),
    "Product": ["Laptop", "Mobile", "Tablet", "Laptop", "Headphones", "Mobile", "Laptop", "Tablet", "Mobile", "Headphones"],
    "Category": ["Electronics", "Electronics", "Electronics", "Electronics", "Accessories", "Electronics", "Electronics", "Electronics", "Electronics", "Accessories"],
    "Quantity": [2, 5, 3, 1, 10, 4, 2, 6, 7, 8],
    "Price": [60000, 20000, 15000, 62000, 2000, 21000, 61000, 15500, 20500, 2500],
    "Region": ["North", "South", "East", "West", "North", "South", "East", "West", "North","west" ]
})

df=pd.DataFrame(std)
# print(df)
# droping column english
# df.drop(['Math'],axis=1,inplace=True)
# df

# increasing math grace marks 5+ for each std...
df['Math']+=5;
df


# adding student
data={'StudentID':11, 'Name':'BB','Age':30, 'Department':'CS', 'Math':59,'Science':90, 'English':75}
newdata=pd.DataFrame([data])
newupd=pd.concat([df,newdata],ignore_index=True)
newupd


# to edit existing value
newupd.iloc[1,1]='Boby'
newupd

# to drop a perticular row
newupd.drop(3,inplace=True)
newupd

    StudentID     Name  Age Department  Math  Science  English
0           1    Alice   20         CS    90       80       75
1           2     Boby   21         IT    83       85       88
2           3  Charlie   19         CS    97       70       82
4           5      Eva   20         IT    93       92       85
5           6    Frank   23         CS    79       75       80
6           7    Grace   21        ECE    95       88       90
7           8    Helen   20         IT    87       78       86
8           9      Ian   22         CS   100       85       84
9          10     Jane   19        ECE    75       72       73
10         11       BB   30         CS    59       90       75

In [61]:
!git --info-path

C:/Program Files/Git/mingw64/share/info

In [62]:
!git add pandas.ipynb

warning: in the working copy of 'pandas.ipynb', LF will be replaced by CRLF the next time Git touches it